;=============================================================================================
; Временные задержки
;
; 		Del_1mks -   1мкс
; 		Del_5mks -   5мкс
; 		Del_10mks -  10мкс
; 		Del_25mks -  25мкс
; 		Del_50mks -  50мкс
; 		Del_75mks -  75мкс
; 		Del_100mks - 100мкс
; 		Del_250mks - 250мкс
; 		Del_500mks - 500мкс
; 		Del_750mks - 750мкс
; 		Del_1ms -    1мс
; 		Del_5ms -    5мс
; 		Del_10ms -   10мс
; 		Del_25ms -   25мс
; 		Del_50ms -   50мс
; 		Del_75ms -   75мс
; 		Del_100ms -  100мс
; 		Del_250ms -  250мс
; 		Del_500ms -  500мс
; 		Del_750ms -  750мс
; 		Del_1s -     1с
; 		Del_2s -     2с
; 		Del_3s -     3с
; 		Del_4s -     4с
; 		Del_5s -     5с
;
;           ВНИМАНИЕ: Подпрограммы разработанны для SYSCLK = xxxxx
;           1 такт = 1/24000000 = ~41,6667ns
	    1 tact = 1/8000000 = 12,5ns

	1mks = 1000 ns
	1ms  = 1000 mks = 1000000ns
	1s   = 1000 ms = 1000000000ns
;
;=============================================================================================
;---------------------------------------------------------------------------------------------
; Временная задержка 1мкс = 24 такта (80 для 8 mhz)

Del_1mks:													; Вызов LCALL 4 такта |
						push	ACC							; 2 такта             |
						push	B								; 2 такта             |
						mul	AB								; 4 такта             | 22 татка
						nop									; 1 такт              |
						nop									; 1 такт              |
						nop									; 1 такт              |
						pop	B								; 2 такта             |
						pop	ACC							; 2 такта             |
						ret									; Возврат 5 тактов    |

;=============================================================================================
; Временная задержка 5мкс = 120 тактов
;
; Формула: 6+(2+((R0-1)*3)+2+1)+7
; Данные:  R0 = 35
; Итого:   6+(2+((35-1)*3)+2+1)+7 = 120
;---------------------------------------------------------------------------------------------
Del_5mks:													; Вызов LCALL 4 такта |
						push	00h							; 2 такта             | 6 тактов

						mov   R0,#35						; 2 такта             |
						djnz  R0,$							; (34*3)+2=104 такта  | 107 тактов
						nop									; 1 такт              |
						
						pop	00h							; 2 такта             | 7 тактов
						ret									; Возврат 5 тактов    |

;=============================================================================================
; Временная задержка 10мкс = 240 тактов
;
; Формула: 6+(2+((R0-1)*3)+2+1)+7
; Данные:  R0 = 75
; Итого:   6+(2+((75-1)*3)+2+1)+7 = 240
;---------------------------------------------------------------------------------------------
Del_10mks:													; Вызов LCALL 4 такта |
						push	00h							; 2 такта             | 6 тактов

						mov   R0,#75						; 2 такта             |
						djnz  R0,$							; (74*3)+2=224 такта  | 227 тактов
						nop									; 1 такт              |
						
						pop	00h							; 2 такта             | 7 тактов
						ret									; Возврат 5 тактов    |

;=============================================================================================
; Временная задержка 25мкс = 600 тактов
;
; Формула: 6+(2+((R0-1)*3)+2+1)+7
; Данные:  R0 = 195
; Итого:   6+(2+((195-1)*3)+2+1)+7 = 600
;---------------------------------------------------------------------------------------------
Del_25mks:													; Вызов LCALL 4 такта |
						push	00h							; 2 такта             | 6 тактов

						mov   R0,#195						; 2 такта             |
						djnz  R0,$							; (194*3)+2=584 такта | 587 тактов
						nop									; 1 такт              |
						
						pop	00h							; 2 такта             | 7 тактов
						ret									; Возврат 5 тактов    |

;=============================================================================================
; Временная задержка 50мкс = 1200 тактов
;
; Формула: 8+(2+((R0-1)*3)+2)+(2+(((R2-1)*3)+2))+9
; Данные:  R0 = 140
;          R1 = 253
; Итого:   8+(2+((140-1)*3)+2)+(2+(((253-1)*3)+2))+2+9 = 1200
;---------------------------------------------------------------------------------------------
Del_50mks:													; Вызов LCALL 4 такта |
						push	00h							; 2 такта             | 8 тактов
						push	01h							; 2 такта             |
						
						mov   R0,#140						; 2 такта             |
						djnz  R0,$							; (139*3)+2=419 такта | 421 тактов
						
						mov   R1,#253						; 2 такта             |
						djnz  R1,$							; (252*3)+2=758 такта | 760 тактов
						
						nop									; 1 такт              | 
						nop									; 1 такт              | 2 такта
						
						pop	01h							; 2 такта             |
						pop	00h							; 2 такта             | 9 тактов
						ret									; Возврат 5 тактов    |

;=============================================================================================
; Временная задержка 75мкс = 1800 тактов
;
; Формула: 12+(((((R0-1)*3)+2+5)*R1)-1)+(2+(((R2-1)*3)+2+1))+11
; Данные:  R0 = 57
;          R1 = 9
;          R2 = 67
; Итого:   12+(((((57-1)*3)+2+5)*9)-1)+(2+(((67-1)*3)+2+1))+11 = 1800
;---------------------------------------------------------------------------------------------
Del_75mks:													; Вызов LCALL 4 такта |
						push	00h							; 2 такта             |
						push	01h							; 2 такта             |
						push	02h							; 2 такта             | 12 тактов
																;                     |
						mov   R1,#9							; 2 такта             |
						
						mov   R0,#57						; 2 такта             | (175*9)-1=
						djnz  R0,$							; (56*3)+2=170 такта  | 1574 тактов
						djnz	R1,$-4						; 3 такта             |

						mov   R2,#67						; 2 такта             |
						djnz  R2,$							; (66*3)+2=200 тактов | 203 тактов
						nop									; 1 такт              |
						
						pop	02h							; 2 такта             |
						pop	01h							; 2 такта             | 11 тактов
						pop	00h							; 2 такта             |
						ret									; Возврат 5 тактов    |

;=============================================================================================
; Временная задержка 100мкс = 2400 тактов
;
; Формула: 12+(((((R0-1)*3)+2+5)*R1)-1)+(2+(((R2-1)*3)+2+1))+11
; Данные:  R0 = 78
;          R1 = 9
;          R2 = 78
; Итого:   12+(((((78-1)*3)+2+5)*9)-1)+(2+(((78-1)*3)+2+1))+11 = 2400
;---------------------------------------------------------------------------------------------
Del_100mks:													; Вызов LCALL 4 такта |
						push	00h							; 2 такта             |
						push	01h							; 2 такта             |
						push	02h							; 2 такта             | 12 тактов
																;                     |
						mov   R1,#9							; 2 такта             |
						
						mov   R0,#78						; 2 такта             | (238*9)-1=
						djnz  R0,$							; (77*3)+2=233 такта  | 2141 тактов
						djnz	R1,$-4						; 3 такта             |

						mov   R2,#78						; 2 такта             |
						djnz  R2,$							; (77*3)+2=233 тактов | 236 тактов
						nop									; 1 такт              |
						
						pop	02h							; 2 такта             |
						pop	01h							; 2 такта             | 11 тактов
						pop	00h							; 2 такта             |
						ret									; Возврат 5 тактов    |

;=============================================================================================
; Временная задержка 250мкс = 6000 тактов
;
; Формула: 12+(((((R0-1)*3)+2+5)*R1)-1)+(2+(((R2-1)*3)+2+1))+11
; Данные:  R0 = 188
;          R1 = 10
;          R2 = 99
; Итого:   12+(((((188-1)*3)+2+5)*10)-1)+(2+(((99-1)*3)+2))+11 = 6000
;---------------------------------------------------------------------------------------------
Del_250mks:													; Вызов LCALL 4 такта |
						push	00h							; 2 такта             |
						push	01h							; 2 такта             |
						push	02h							; 2 такта             | 12 тактов
																;                     |
						mov   R1,#10						; 2 такта             |
						
						mov   R0,#188						; 2 такта             | (568*10)-1=
						djnz  R0,$							; (187*3)+2=563 такта | 5679 тактов
						djnz	R1,$-4						; 3 такта             |

						mov   R2,#99						; 2 такта             |
						djnz  R2,$							; (98*3)+2=296 тактов | 298 тактов
						
						pop	02h							; 2 такта             |
						pop	01h							; 2 такта             | 11 тактов
						pop	00h							; 2 такта             |
						ret									; Возврат 5 тактов    |

;=============================================================================================
; Временная задержка 500мкс = 12000 тактов
;
; Формула: 12+(((((R0-1)*3)+2+5)*R1)-1)+(2+(((R2-1)*3)+2+1))+11
; Данные:  R0 = 195
;          R1 = 20
;          R2 = 65
; Итого:   12+(((((166-1)*3)+2+5)*10)-1)+(2+(((162-1)*3)+2+1))+11 = 12000
;---------------------------------------------------------------------------------------------
Del_500mks:													; Вызов LCALL 4 такта |
						push	00h							; 2 такта             |
						push	01h							; 2 такта             |
						push	02h							; 2 такта             | 12 тактов
																;                     |
						mov   R1,#20						; 2 такта             |
						
						mov   R0,#195						; 2 такта             | (589*20)-1=
						djnz  R0,$							; (194*3)+2=584 такта | 11779 тактов
						djnz	R1,$-4						; 3 такта             |

						mov   R2,#65						; 2 такта             |
						djnz  R2,$							; (64*3)+2=194 тактов | 198 тактов
						nop									; 1 такт              |
						nop									; 1 такт              |
						
						pop	02h							; 2 такта             |
						pop	01h							; 2 такта             | 11 тактов
						pop	00h							; 2 такта             |
						ret									; Возврат 5 тактов    |

;=============================================================================================
; Временная задержка 750mks = 18000 тактов
;
; Формула: 12+(((((R0-1)*3)+2+5)*R1)-1)+(2+(((R2-1)*3)+2+1+1))+11
; Данные:  R0 = 195
;          R1 = 30
;          R2 = 102
; Итого:   12+(((((195-1)*3)+2+5)*30)-1)+(2+(((102-1)*3)+2+1))+11 = 18000
;---------------------------------------------------------------------------------------------
Del_750mks:													; Вызов LCALL 4 такта |
						push	00h							; 2 такта             |
						push	01h							; 2 такта             |
						push	02h							; 2 такта             | 12 тактов
																;                     |
						mov   R1,#30						; 2 такта             |
						
						mov   R0,#195						; 2 такта             | (589*30)-1=
						djnz  R0,$							; (194*3)+2=584 такта | 17669 тактов
						djnz	R1,$-4						; 3 такта             |
						
						mov   R2,#102						; 2 такта             |
						djnz  R2,$							; (101*3)+2=305 тактов| 308 тактов
						nop									; 1 такт              |
						
						pop	02h							; 2 такта             |
						pop	01h							; 2 такта             | 11 тактов
						pop	00h							; 2 такта             |
						ret									; Возврат 5 тактов    |

;=============================================================================================
; Временная задержка 1мс = 24000 тактов
;
; Формула: 12+(((((R0-1)*3)+2+5)*R1)-1)+(2+(((R2-1)*3)+2+1+1))+11
; Данные:  R0 = 156
;          R1 = 50
;          R2 = 125
; Итого:   12+(((((156-1)*3)+2+5)*50)-1)+(2+(((125-1)*3)+2+1+1))+11 = 24000
;---------------------------------------------------------------------------------------------
Del_1ms:														; Вызов LCALL 4 такта |
						push	00h							; 2 такта             |
						push	01h							; 2 такта             |
						push	02h							; 2 такта             | 12 тактов
																;                     |
						mov   R1,#50						; 2 такта             |
						
						mov   R0,#156						; 2 такта             | (472*50)-1=
						djnz  R0,$							; (155*3)+2=467 такта | 23599 тактов
						djnz	R1,$-4						; 3 такта             |
						
						mov   R2,#125						; 2 такта             |
						djnz  R2,$							; (124*3)+2=374 тактов| 378 тактов
						nop									; 1 такт              |
						nop									; 1 такт              |
						
						pop	02h							; 2 такта             |
						pop	01h							; 2 такта             | 11 тактов
						pop	00h							; 2 такта             |
						ret									; Возврат 5 тактов    |

;=============================================================================================
; Временная задержка 5мс = 120000 тактов
;
; Формула: 12+(((((R0-1)*3)+2+5)*R1)-1)+(2+(((R2-1)*3)+2+1))+11
; Данные:  R0 = 198
;          R1 = 200
;          R2 = 125
; Итого:   12+(((((198-1)*3)+2+5)*200)-1)+(2+(((125-1)*3)+2+1+1))+11 = 120000
;---------------------------------------------------------------------------------------------
Del_5ms:														; Вызов LCALL 4 такта |
						push	00h							; 2 такта             |
						push	01h							; 2 такта             |
						push	02h							; 2 такта             | 12 тактов
																;                     |
						mov   R1,#200						; 2 такта             |
																
						mov   R0,#198						; 2 такта             | (598*200)-1=
						djnz  R0,$							; (197*3)+2=593 такта | 119599 тактов
						djnz	R1,$-4						; 3 такта             |

						mov   R2,#125						; 2 такта             |
						djnz  R2,$							; (124*3)+2=374 тактов| 378 тактов
						nop									; 1 такт              |
						nop									; 1 такт              |
						
						pop	02h							; 2 такта             |
						pop	01h							; 2 такта             | 11 тактов
						pop	00h							; 2 такта             |
						ret									; Возврат 5 тактов    |		
								
;=============================================================================================
; Временная задержка 10мс = 240000 такта
;
; Формула: 14+(((2+((((2+(((R0-1)*3)+2))+3)*R1)-1)+3)*R2)-1)+(2+(((R3-1)*3)+2))+13
; Данные:  R0 = 78
;          R1 = 168
;          R2 = 6
;          R3 = 15
; Итого:   14+(((2+((((2+(((78-1)*3)+2))+3)*168)-1)+3)*6)-1)+(2+(((15-1)*3)+2))+13 = 240000
;---------------------------------------------------------------------------------------------
Del_10ms:													; Вызов LCALL 4 такта |
						push	00h							; 2 такта             |
						push	01h							; 2 такта             |
						push	02h							; 2 такта             | 14 тактов
						push	03h							; 2 такта             |
																;                     |
						mov   R2,#6							; 2 такта             |					
									
						mov   R1,#168	;              | 2 такта +           |
						mov   R0,#78	; 2 такта +    |                     | (39988*6)-1=
						djnz	R0,$		; (77*3)+2=233 | (((235+3)*168)-1)=  | 239927 тактов
						djnz  R1,$-4	;              |    55249 тактов     |   
						djnz	R2,$-8	;              | + 3 такта           |

						mov   R3,#15						; 2 такта             |
						djnz  R3,$							; (14*3)+2=44 тактов  | 46 тактов
						
						pop	03h							; 2 такта             |
						pop	02h							; 2 такта             |
						pop	01h							; 2 такта             | 13 тактов
						pop	00h							; 2 такта             |
						ret									; Возврат 5 тактов    |

;=============================================================================================
; Временная задержка 25мс = 600000 тактов
;
; Формула: 14+(((2+((((2+(((R0-1)*3)+2))+3)*R1)-1)+3)*R2)-1)+(2+(((R3-1)*3)+2))+13
; Данные:  R0 = 78
;          R1 = 168
;          R2 = 15
;          R3 = 51
; Итого:   14+(((2+((((2+(((78-1)*3)+2))+3)*168)-1)+3)*15)-1)+(2+(((51-1)*3)+2))+13 = 600000
;---------------------------------------------------------------------------------------------
Del_25ms:													; Вызов LCALL 4 такта |
						push	00h							; 2 такта             |
						push	01h							; 2 такта             |
						push	02h							; 2 такта             | 14 тактов
						push	03h							; 2 такта             |
																;                     |
						mov   R2,#15						; 2 такта             |					
									
						mov   R1,#168	;              | 2 такта +           |
						mov   R0,#78	; 2 такта +    |                     | (39988*15)-1=
						djnz	R0,$		; (77*3)+2=233 | (((235+3)*168)-1)=  | 599819 тактов
						djnz  R1,$-4	;              |    55249 тактов     |   
						djnz	R2,$-8	;              | + 3 такта           |

						mov   R3,#51						; 2 такта             |
						djnz  R3,$							; (50*3)+2=152 тактов | 154 тактов
						
						pop	03h							; 2 такта             |
						pop	02h							; 2 такта             |
						pop	01h							; 2 такта             | 13 тактов
						pop	00h							; 2 такта             |
						ret									; Возврат 5 тактов    |

;=============================================================================================
; Временная задержка 50мс = 1200000 тактов
;
; Формула: 14+(((2+((((2+(((R0-1)*3)+2))+3)*R1)-1)+3)*R2)-1)+(2+(((R3-1)*3)+2))+13
; Данные:  R0 = 78
;          R1 = 168
;          R2 = 30
;          R3 = 111
; Итого:   14+(((2+((((2+(((78-1)*3)+2))+3)*168)-1)+3)*30)-1)+(2+(((111-1)*3)+2))+13 = 1200000
;---------------------------------------------------------------------------------------------
Del_50ms:													; Вызов LCALL 4 такта |
						push	00h							; 2 такта             |
						push	01h							; 2 такта             |
						push	02h							; 2 такта             | 14 тактов
						push	03h							; 2 такта             |
																;                     |
						mov   R2,#30						; 2 такта             |					
									
						mov   R1,#168	;              | 2 такта +           |
						mov   R0,#78	; 2 такта +    |                     | (39988*30)-1=
						djnz	R0,$		; (77*3)+2=233 | (((235+3)*168)-1)=  | 1199639 тактов
						djnz  R1,$-4	;              |    55249 тактов     |   
						djnz	R2,$-8	;              | + 3 такта           |

						mov   R3,#111						; 2 такта             |
						djnz  R3,$							; (110*3)+2=332 тактов| 334 тактов
						
						pop	03h							; 2 такта             |
						pop	02h							; 2 такта             |
						pop	01h							; 2 такта             | 13 тактов
						pop	00h							; 2 такта             |
						ret									; Возврат 5 тактов    |

;=============================================================================================
; Временная задержка 75мс = 1800000 тактов
;
; Формула: 14+(((2+((((2+(((R0-1)*3)+2))+3)*R1)-1)+3)*R2)-1)+(2+(((R3-1)*3)+2))+13
; Данные:  R0 = 78
;          R1 = 168
;          R2 = 45
;          R3 = 171
; Итого:   14+(((2+((((2+(((78-1)*3)+2))+3)*168)-1)+3)*45)-1)+(2+(((171-1)*3)+2))+13 = 1800000
;---------------------------------------------------------------------------------------------
Del_75ms:													; Вызов LCALL 4 такта |
						push	00h							; 2 такта             |
						push	01h							; 2 такта             |
						push	02h							; 2 такта             | 14 тактов
						push	03h							; 2 такта             |
																;                     |
						mov   R2,#45						; 2 такта             |					
									
						mov   R1,#168	;              | 2 такта +           |
						mov   R0,#78	; 2 такта +    |                     | (39988*45)-1=
						djnz	R0,$		; (77*3)+2=233 | (((235+3)*168)-1)=  | 1799459 тактов
						djnz  R1,$-4	;              |    55249 тактов     |   
						djnz	R2,$-8	;              | + 3 такта           |

						mov   R3,#171						; 2 такта             |
						djnz  R3,$							; (170*3)+2=512 тактов| 514 тактов
						
						pop	03h							; 2 такта             |
						pop	02h							; 2 такта             |
						pop	01h							; 2 такта             | 13 тактов
						pop	00h							; 2 такта             |
						ret									; Возврат 5 тактов    |

;=============================================================================================
; Временная задержка 100мс = 2400000 тактов
;
; Формула: 14+(((2+((((2+(((R0-1)*3)+2))+3)*R1)-1)+3)*R2)-1)+(2+(((R3-1)*3)+2))+13
; Данные:  R0 = 78
;          R1 = 168
;          R2 = 30
;          R3 = 111
; Итого:   14+(((2+((((2+(((78-1)*3)+2))+3)*168)-1)+3)*60)-1)+(2+(((231-1)*3)+2))+13 = 2400000
;---------------------------------------------------------------------------------------------
Del_100ms:													; Вызов LCALL 4 такта |
						push	00h							; 2 такта             |
						push	01h							; 2 такта             |
						push	02h							; 2 такта             | 14 тактов
						push	03h							; 2 такта             |
																;                     |
						mov   R2,#60						; 2 такта             |					
									
						mov   R1,#168	;              | 2 такта +           |
						mov   R0,#78	; 2 такта +    |                     | (39988*60)-1=
						djnz	R0,$		; (77*3)+2=233 | (((235+3)*168)-1)=  | 2399279 тактов
						djnz  R1,$-4	;              |    55249 тактов     |   
						djnz	R2,$-8	;              | + 3 такта           |

						mov   R3,#231						; 2 такта             |
						djnz  R3,$							; (230*3)+2=692 тактов| 694 тактов
						
						pop	03h							; 2 такта             |
						pop	02h							; 2 такта             |
						pop	01h							; 2 такта             | 13 тактов
						pop	00h							; 2 такта             |
						ret									; Возврат 5 тактов    |

;=============================================================================================
; Временная задержка 250мс = 6000000 тактов
;
; Формула: 14+(((2+((((2+(((R0-1)*3)+2))+3)*R1)-1)+3)*R2)-1)+(2+(((R3-1)*3)+2))+13
; Данные:  R0 = 109
;          R1 = 125
;          R2 = 145
;          R3 = 6
; Итого:   14+(((2+((((2+(((109-1)*3)+2))+3)*125)-1)+3)*145)-1)+(2+(((6-1)*3)+2))+13 = 6000000
;---------------------------------------------------------------------------------------------
Del_250ms:													; Вызов LCALL 4 такта |
						push	00h							; 2 такта             |
						push	01h							; 2 такта             |
						push	02h							; 2 такта             | 14 тактов
						push	03h							; 2 такта             |
																;                     |
						mov   R2,#145						; 2 такта             |					
									
						mov   R1,#125	;              | 2 такта +           |
						mov   R0,#109	; 2 такта +    |                     | (41379*145)-1=
						djnz	R0,$		; (108*3)+2=326| (((328+3)*125)-1)=  | 5999954 тактов
						djnz  R1,$-4	;              |    41374 тактов     |   
						djnz	R2,$-8	;              | + 3 такта           |

						mov   R3,#6							; 2 такта             |
						djnz  R3,$							; (5*3)+2=17 тактов   | 19 тактов
						
						pop	03h							; 2 такта             |
						pop	02h							; 2 такта             |
						pop	01h							; 2 такта             | 13 тактов
						pop	00h							; 2 такта             |
						ret									; Возврат 5 тактов    |

;=============================================================================================
; Временная задержка 500мс = 12000000 тактов
;
; Формула: 14+(((2+((((2+(((R0-1)*3)+2))+3)*R1)-1)+3)*R2)-1)+(2+(((R3-1)*3)+2))+13
; Данные:  R0 = 190
;          R1 = 185
;          R2 = 113
;          R3 = 17
; Итого:   14+(((2+((((2+(((190-1)*3)+2))+3)*185)-1)+3)*113)-1)+(2+(((17-1)*3)+2))+13 = 12000000
;---------------------------------------------------------------------------------------------
Del_500ms:													; Вызов LCALL 4 такта |
						push	00h							; 2 такта             |
						push	01h							; 2 такта             |
						push	02h							; 2 такта             | 14 тактов
						push	03h							; 2 такта             |
																;                     |
						mov   R2,#113						; 2 такта             |		
									
						mov   R1,#185	;              | 2 такта +           |
						mov   R0,#190	; 2 такта +    |                     | (106194*113)-1=
						djnz	R0,$		; (189*3)+2=569| (((571+3)*185)-1)=  | 11999921 тактов
						djnz  R1,$-4	;              |   106189 тактов     |   
						djnz	R2,$-8	;              | + 3 такта           |

						mov   R3,#17						; 2 такта             | 52 тактов
						djnz  R3,$							; (16*3)+2=50 тактов  |
						
						pop	03h							; 2 такта             |
						pop	02h							; 2 такта             |
						pop	01h							; 2 такта             | 13 тактов
						pop	00h							; 2 такта             |
						ret									; Возврат 5 тактов    |

;=============================================================================================
; Временная задержка 750мс = 18000000 тактов
;
; Формула: 14+(((2+((((2+(((R0-1)*3)+2))+3)*R1)-1)+3)*R2)-1)+(2+(((R3-1)*3)+2))+13
; Данные:  R0 = 228
;          R1 = 206
;          R2 = 127
;          R3 = 3
; Итого:   14+(((2+((((2+(((228-1)*3)+2))+3)*206)-1)+3)*127)-1)+(2+(((3-1)*3)+2))+13 = 18000000
;---------------------------------------------------------------------------------------------
Del_750ms:													; Вызов LCALL 4 такта |
						push	00h							; 2 такта             |
						push	01h							; 2 такта             |
						push	02h							; 2 такта             | 14 тактов
						push	03h							; 2 такта             |
																;                     |
						mov   R2,#127						; 2 такта       	    |		
									
						mov   R1,#206	;              | 2 такта +           |
						mov   R0,#228	; 2 такта +    |                     | (141732*127)-1=
						djnz	R0,$		; (227*3)+2=683| (((685+3)*206)-1)=  | 17999963 тактов
						djnz  R1,$-4	;              |    141727 тактов    |   
						djnz	R2,$-8	;              | + 3 такта           |

						mov   R3,#3							; 2 такта             | 10 тактов
						djnz  R3,$							; (2*3)+2=8 тактов    |
						
						pop	03h							; 2 такта             |
						pop	02h							; 2 такта             |
						pop	01h							; 2 такта             | 13 тактов
						pop	00h							; 2 такта             |
						ret									; Возврат 5 тактов    |

;=============================================================================================
; Временная задержка 1с = 24000000 тактов
;
; Формула: 14+(((2+((((2+(((R0-1)*3)+2))+3)*R1)-1)+3)*R2)-1)+(2+(((R3-1)*3)+2))+13
; Данные:  R0 = 237
;          R1 = 137
;          R2 = 245
;          R3 = 6
; Итого:   14+(((2+((((2+(((237-1)*3)+2))+3)*137)-1)+3)*245)-1)+(2+(((6-1)*3)+2))+13 = 24000000
;---------------------------------------------------------------------------------------------
Del_1s:														; Вызов LCALL 4 такта |
						push	00h							; 2 такта             |
						push	01h							; 2 такта             |
						push	02h							; 2 такта             | 14 тактов
						push	03h							; 2 такта             |
																;                     |
						mov   R2,#245						; 2 такта       	    |		
									
						mov   R1,#137	;              | 2 такта +           |
						mov   R0,#237	; 2 такта +    |                     | (97959*245)-1=
						djnz	R0,$		; (236*3)+2=710| (((712+3)*137)-1)=  | 23999954 тактов
						djnz  R1,$-4	;              |    97954 тактов     |   
						djnz	R2,$-8	;              | + 3 такта           |

						mov   R3,#6							; 2 такта             | 19 тактов
						djnz  R3,$							; (5*3)+2=17 тактов   |
						
						pop	03h							; 2 такта             |
						pop	02h							; 2 такта             |
						pop	01h							; 2 такта             | 13 тактов
						pop	00h							; 2 такта             |
						ret									; Возврат 5 тактов    |

;=============================================================================================
; Временная задержка 2с
;---------------------------------------------------------------------------------------------
Del_2s:				lcall	Del_1s
						lcall	Del_1s
						ret

;=============================================================================================
; Временная задержка 3с
;---------------------------------------------------------------------------------------------
Del_3s:				lcall	Del_1s
						lcall	Del_1s
						lcall	Del_1s
						ret

;=============================================================================================
; Временная задержка 4с
;---------------------------------------------------------------------------------------------
Del_4s:				lcall	Del_1s
						lcall	Del_1s
						lcall	Del_1s
						lcall	Del_1s
						ret

;=============================================================================================
; Временная задержка 5с
;---------------------------------------------------------------------------------------------
Del_5s:				lcall	Del_1s
						lcall	Del_1s
						lcall	Del_1s
						lcall	Del_1s
						lcall	Del_1s
						ret


